## EDA Tiller System

### Loading file

Download the lab data by following this [link](https://drive.google.com/file/d/1X5uXVFrl7SuMUKe7CJaiCmGEOhokorh2/view?usp=sharing)

a) Load the Tiller_order_data.csv file into a DataFrame named df

In [ ]:
#.agg('Population: 'sum', ''Area: 'mean')

In [1]:
#let's try it :-)

import pandas as pd

df = pd.read_csv('./Tiller_order_data.csv', low_memory=False)

In [4]:
df.head(1)

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17 UTC,2019-01-12 19:58:38 UTC,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5

### Data Discovery

b) Display the first 5 rows of this dataframe

In [5]:
#Let's try it :-)
df.head(5)

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17 UTC,2019-01-12 19:58:38 UTC,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5
1,56035309,8052,NaN,NaN,NaN,75E41FE2-64FF-41D3-954C-A7DE4AA887EF,15327.0,2019-01-16 19:39:09 UTC,2019-01-16 22:10:50 UTC,frere et soeur avec pierre,CLOSED,1,NaN,Tiller iPAD,2,49.8,49.8
2,55550051,8052,NaN,NaN,NaN,F6051A05-C9AC-4033-BF72-BB5149B8F439,15327.0,2019-01-12 14:18:46 UTC,2019-01-12 19:50:32 UTC,rachel,CLOSED,1,NaN,Tiller iPAD,1,27.4,27.4
3,57000119,8052,NaN,16199.0,NaN,B8BEEC66-1C10-48A0-B4D5-035CB5EEFE62,15327.0,2019-01-24 17:49:12 UTC,2019-01-24 21:58:59 UTC,Groupe PEL,CLOSED,1,NaN,tiller-order,3,60.0,60.0
4,55558817,8052,NaN,NaN,NaN,17F0533C-2FF1-4FC5-A50D-12704C7B7A4B,15327.0,2019-01-12 15:25:06 UTC,2019-01-12 19:21:03 UTC,remi et date,CLOSED,1,NaN,Tiller iPAD,2,39.9,39.9

c) What does a row of this dataframe represent? What information can you find?

In [5]:
#Let's try it :-)
# order management: row shows one order transaction
df.head(1)
# column features:

   id_order  id_store  id_table  ...  m_nb_customer  m_cached_payed m_cached_price
0  55538867      8052       NaN  ...              1            45.5           45.5

[1 rows x 17 columns]

In [5]:
# each row has following information
df.columns

Index(['id_order', 'id_store', 'id_table', 'id_waiter', 'id_customer',
       'id_external', 'id_device', 'date_opened', 'date_closed', 'dim_name',
       'dim_status', 'dim_type', 'dim_comment', 'dim_source', 'm_nb_customer',
       'm_cached_payed', 'm_cached_price'],
      dtype='object')

d) How many orders are there in this dataframe? How many columns?

In [63]:
# counts the amount of entries 
totalOrders = df['id_order'].count()
totalOrders

117304

In [21]:
# counts the amount of values
df['id_order'].value_counts()

55538867     1
98394465     1
141379937    1
137955892    1
81456389     1
            ..
95910271     1
94147715     1
63666263     1
60359283     1
93223821     1
Name: id_order, Length: 117304, dtype: int64

#### Column selection

e) Select only the id_order, id_store, date_opened and date_closed columns of this DataFrame and save the result in a variable df_sub

In [22]:
#Let's try it :-)
# select columns
df_sub = df[['id_order','id_store', 'date_opened' , 'date_closed']]
df_sub.head(5)

   id_order  id_store              date_opened              date_closed
0  55538867      8052  2019-01-12 13:02:17 UTC  2019-01-12 19:58:38 UTC
1  56035309      8052  2019-01-16 19:39:09 UTC  2019-01-16 22:10:50 UTC
2  55550051      8052  2019-01-12 14:18:46 UTC  2019-01-12 19:50:32 UTC
3  57000119      8052  2019-01-24 17:49:12 UTC  2019-01-24 21:58:59 UTC
4  55558817      8052  2019-01-12 15:25:06 UTC  2019-01-12 19:21:03 UTC

#### Row selection

f) Filter df_sub only on lines concerning id_store 4542. How many orders have there been in this restaurant?

In [18]:
#Let's try it :-)
# build up a mask
mask = df_sub['id_store'] == 4542
# use count() function to count every element of each column
df_id_store_info = df_sub[mask].count()
#show data
df_id_store_info

id_order       17641
id_store       17641
date_opened    17641
date_closed    17641
dtype: int64

### Data analysis

g) Going back to the initial DataFrame, what are the different possible statuses of an order? How many orders are there per status?

In [36]:
# use .unique() to get different entries inside an array
unique_entries = df['dim_status'].unique()
print(unique_entries)
type(unique_entries)

['CLOSED' 'IN_PROGRESS']

numpy.ndarray

In [32]:
#get count by using value_count the way of pandas
closeOrders = df["dim_status"].value_counts().get('CLOSED')
print(f"this is the number of orders with status CLOSE: {closeOrders}")

this is the number of orders with status CLOSE: 116939

In [33]:
# 2nd way to get count 
closeOrders = len(df.query("dim_status == 'CLOSED'"))
print(f"this is the number of orders with status CLOSE: {closeOrders}")

this is the number of orders with status CLOSE: 116939

In [34]:
# 2nd way to get count
progressOrders = len(df.query("dim_status == 'IN_PROGRESS'"))
print(f"this is the number of orders with status IN_PROGRESS: {progressOrders}")

this is the number of orders with status IN_PROGRESS: 365

h) What is the proportion of orders whose status is CLOSE?

In [41]:
#Let's try it :-)
# percentage of close orders
# counts the amount of entries 
totalOrders = df['id_order'].count()
percentageClose = (closeOrders/totalOrders) *100
print(f"proportion of orders with status CLOSE: {percentageClose: .3f}%")

proportion of orders with status CLOSE:  99.689%

i) How many restaurants are there in this data? What are their IDs?

In [65]:
restaurants = df["id_store"].unique()
count_of_restaurant = len(restaurants)
restaurants
print(f"There are {count_of_restaurant} restaurants with following IDs: {restaurants}")

There are 10 restaurants with followint IDs: [8052 8347 8283 9084 4337  360 1796 7965 6293 4542]

In [120]:
restaurants = df["id_store"].unique().size
restaurants

10

In [48]:
#Let's try it :-)
# filter for id_store
restaurants = df["id_store"].unique()
print(f"There are {len(restaurants)} different restaurants in this datset")
print(len(restaurants))

There are 10 different restaurants in this datset
10

j) Calculate the turnover per restaurant. Which restaurant has the highest turnover?

In [99]:
df.head(1)

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17 UTC,2019-01-12 19:58:38 UTC,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5

In [66]:
#Let's try it :-)

#use groupby to group the DataFrame by the 'id_store' column.
# calculate the sum of 'm_cached_payed' for each restaurant using sum()
#reset the index to obtain a DataFrame with 'id_store' and their respective turnovers.
df_sub_restaurant_turnover = df.groupby('id_store')['m_cached_payed'].sum().reset_index()
df_sub_restaurant_turnover

   id_store  m_cached_payed
0       360       387089.14
1      1796       321099.69
2      4337       865357.89
3      4542       243728.69
4      6293       359471.00
5      7965      1138690.95
6      8052       327758.85
7      8283       369822.82
8      8347           23.00
9      9084       479019.75

In [70]:
#get the id of the restaurant with max turnover
idMaxTurnover = df_sub_restaurant_turnover["m_cached_payed"].idxmax()
maxTurnover = df_sub_restaurant_turnover["m_cached_payed"].max()
print(f"index of restaurant with maximum turnover : {idMaxTurnover}")
print(f"Maximimum turnover {maxTurnover}")

index of restaurant with maximum turnover : 5
Maximimum turnover 1138690.95

In [72]:
#find the restaurant with the maximum turnover using idMaxTurnover and loc[].
#with id loc and i loc both worked 
maxTurnoverRestaurant = df_sub_restaurant_turnover.iloc[idMaxTurnover]

#output Restaurant and max turnover
print(f"Restaurant with id {maxTurnoverRestaurant['id_store']} has maximum turnover of {maxTurnover}")


# maxTurnoverRestaurant = df_sub_restaurant_turnover.loc['m_cached_payed'].i

Restaurant with id 7965.0 has maximum turnover of 1138690.95

k) Count the number of orders per restaurant. Which restaurant had the most orders in this data? Is it the same as the one with the highest turnover?

In [73]:
df_sub_orders

NameError: name 'df_sub_orders' is not defined

In [90]:
#Let's try it :-)
# apply .size() to count the number of orders for each restaurant, cause each row = an order.
# reset the index and rename the resulting count column to 'order_total'
df_sub_orders = df.groupby('id_store').size().reset_index(name='order_total')
# order values to column order_total
df_sub_orders['order_total'].sort_values(ascending=True).reset_index()

   index  order_total
0      8            1
1      0         4383
2      6         4906
3      9         7804
4      5         9091
5      7        10023
6      4        16103
7      3        17641
8      2        20003
9      1        27349

In [98]:
# get index of the restaurant with maximum orders 
indexRestaurantMaxOrders = df_sub_orders["order_total"].idxmax()
print(f"{idRestaurantMaxOrders} is the index of restaurant with the maximum order")
# use loc[index] to get row data restaurant with maximum orders
nameRestaurantMaxOrders = df_sub_orders.loc[indexRestaurantMaxOrders]
print(f"Restaurant: {nameRestaurantMaxOrders['id_store']} Orders: {nameRestaurantMaxOrders['order_total']}")

1 is the index of restaurant with the maximum order
Restaurant: 1796 Orders: 27349

l) Calculate the average price of an order for each restaurant. Do you think you face the same types of restaurants?

In [97]:
#Let's try it :-)
# 1.Step- build up a dataframe grouped by id_store

df_average_price = df.groupby('id_store')['m_cached_payed'].mean().reset_index(name='avg_price')
idMaxAvgPrice = df_average_price['avg_price'].idxmax()

maxAvgPrice = df_average_price.loc[idMaxAvgPrice]
print(f"Restaurant {maxAvgPrice['id_store']: .0f} avg price of an order: {maxAvgPrice['avg_price'].max(): .2f} Euro")

Restaurant  7965 avg price of an order:  125.25 Euro

m) The problem is that an order can be placed for several people. We rather want to know the price spent on average by a person in the restaurant.

From the initial dataframe, add a column representing the price of the order per customer

In [147]:
#Let's try it :-)
df["order_per_customer"] = 0
df.head(1)

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price,order_per_customer
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17 UTC,2019-01-12 19:58:38 UTC,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5,0

n) Using the previous column, calculate the average price spent by each person in each of the restaurants.

In [102]:
#Let's try it :-)
# ['id_store', 'dim_name'] defines order of grouping.
# df ordered by id_store first, then each element is ordered by dim_name
id_store = df.groupby(['id_store', 'dim_name'])['m_cached_payed'].mean().reset_index(name='average_price_spent_person')
id_store

      id_store dim_name  average_price_spent_person
0          360       A1                   98.344643
1          360      A10                   36.625000
2          360      A11                   88.000000
3          360      A12                  138.666667
4          360      A13                    0.000000
...        ...      ...                         ...
2006      9084     REMY                  178.000000
2007      9084  SIBILLE                   42.000000
2008      9084    Salim                  139.000000
2009      9084   THOMAS                   64.300000
2010      9084        y                   40.000000

[2011 rows x 3 columns]

o) It seems that there are data problems because for some restaurants the average price is lower ...

Do you have any idea why?

Replace the values ​​at 0 in the m_nb_customer column with 1 then delete the rows whose m_cached_price column is at 0

In [111]:
df['m_nb_customer']

0         1
1         2
2         1
3         3
4         2
         ..
117299    1
117300    1
117301    1
117302    1
117303    1
Name: m_nb_customer, Length: 117304, dtype: int64

In [115]:
#Let's try it :-)
# Replace values at 0 in the 'm_nb_customer' column with 1
df['m_nb_customer'] = df['m_nb_customer'].replace(0,1)

#delete the rows whose m_cached_price column is at 0
mask = df['m_cached_price'] !=0
df = df[mask]
df.head(10)

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17 UTC,2019-01-12 19:58:38 UTC,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5
1,56035309,8052,NaN,NaN,NaN,75E41FE2-64FF-41D3-954C-A7DE4AA887EF,15327.0,2019-01-16 19:39:09 UTC,2019-01-16 22:10:50 UTC,frere et soeur avec pierre,CLOSED,1,NaN,Tiller iPAD,2,49.8,49.8
2,55550051,8052,NaN,NaN,NaN,F6051A05-C9AC-4033-BF72-BB5149B8F439,15327.0,2019-01-12 14:18:46 UTC,2019-01-12 19:50:32 UTC,rachel,CLOSED,1,NaN,Tiller iPAD,1,27.4,27.4
3,57000119,8052,NaN,16199.0,NaN,B8BEEC66-1C10-48A0-B4D5-035CB5EEFE62,15327.0,2019-01-24 17:49:12 UTC,2019-01-24 21:58:59 UTC,Groupe PEL,CLOSED,1,NaN,tiller-order,3,60.0,60.0
4,55558817,8052,NaN,NaN,NaN,17F0533C-2FF1-4FC5-A50D-12704C7B7A4B,15327.0,2019-01-12 15:25:06 UTC,2019-01-12 19:21:03 UTC,remi et date,CLOSED,1,NaN,Tiller iPAD,2,39.9,39.9
5,55451477,8052,NaN,NaN,NaN,570F71DE-504D-4040-BE10-19B5FDF64FAD,15327.0,2019-01-11 19:13:15 UTC,2019-01-11 23:22:04 UTC,abdel,CLOSED,1,NaN,Tiller iPAD,1,25.0,25.0
6,56030563,8052,NaN,NaN,NaN,0BEB2A9B-4A3A-4BEE-AC13-8BDCB03DF568,15327.0,2019-01-16 19:04:08 UTC,2019-01-16 22:13:55 UTC,pierre + 6,CLOSED,1,NaN,Tiller iPAD,7,220.7,220.7
7,56310086,8052,NaN,NaN,NaN,5522AFFD-BC4A-4F24-8129-14400BC529AA,15327.0,2019-01-18 19:06:17 UTC,2019-01-18 23:13:08 UTC,oceane +3,CLOSED,1,NaN,Tiller iPAD,4,111.0,111.0
8,54326699,8052,NaN,NaN,NaN,E41B347F-840F-4067-90F4-76D3E5258A2B,15327.0,2019-01-01 16:33:33 UTC,2019-01-01 23:47:28 UTC,"margaux, agathe et melanie",CLOSED,1,NaN,Tiller iPAD,3,41.0,41.0
9,56479526,8052,NaN,NaN,NaN,B47CEA06-6AD3-406D-81F1-92DA56500267,15327.0,2019-01-19 21:44:00 UTC,2019-01-19 23:15:16 UTC,filles canapé,CLOSED,1,NaN,Tiller iPAD,3,33.9,33.9

p) Recalculate the price_per_customer column and the average price spent by each person in a restaurant

In [173]:
#Let's try it :-)
# group id_store -> group dim_name , then get m_cached_payed
id_store = df.groupby(['id_store', 'dim_name'])['m_cached_payed'].mean().reset_index()
id_store

      id_store dim_name  m_cached_payed
0          360       A1      101.051376
1          360      A10       41.857143
2          360      A11       88.000000
3          360      A12      138.666667
4          360      A14      140.000000
...        ...      ...             ...
2003      9084     REMY      178.000000
2004      9084  SIBILLE       42.000000
2005      9084    Salim      139.000000
2006      9084   THOMAS       64.300000
2007      9084        y       40.000000

[2008 rows x 3 columns]

### Temporal analysis

Restaurant 7965 has a higher price per person than the rest. Let's look at the time spent at the table to find out if this can correspond to a large restaurant.

q) Convert date_opened and date_closed columns to datetime format

In [174]:
df.head(2)

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price,order_per_customer
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17 UTC,2019-01-12 19:58:38 UTC,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5,0
1,56035309,8052,NaN,NaN,NaN,75E41FE2-64FF-41D3-954C-A7DE4AA887EF,15327.0,2019-01-16 19:39:09 UTC,2019-01-16 22:10:50 UTC,frere et soeur avec pierre,CLOSED,1,NaN,Tiller iPAD,2,49.8,49.8,0

In [181]:
#Let's try it :-)
#By using .loc, you are explicitly telling pandas to modify the original DataFrame. 

df['date_opened'] = pd.to_datetime(df['date_opened'])
df['date_closed'] = pd.to_datetime(df['date_closed'])
df

C:\Users\p.nguyen\AppData\Local\Temp\ipykernel_26860\811732765.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['date_opened'] = pd.to_datetime(df['date_opened'])
C:\Users\p.nguyen\AppData\Local\Temp\ipykernel_26860\811732765.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['date_closed'] = pd.to_datetime(df['date_closed'])

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price,order_per_customer,order_duration
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17+00:00,2019-01-12 19:58:38+00:00,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5,0,416.350000
1,56035309,8052,NaN,NaN,NaN,75E41FE2-64FF-41D3-954C-A7DE4AA887EF,15327.0,2019-01-16 19:39:09+00:00,2019-01-16 22:10:50+00:00,frere et soeur avec pierre,CLOSED,1,NaN,Tiller iPAD,2,49.8,49.8,0,151.683333
2,55550051,8052,NaN,NaN,NaN,F6051A05-C9AC-4033-BF72-BB5149B8F439,15327.0,2019-01-12 14:18:46+00:00,2019-01-12 19:50:32+00:00,rachel,CLOSED,1,NaN,Tiller iPAD,1,27.4,27.4,0,331.766667
3,57000119,8052,NaN,16199.0,NaN,B8BEEC66-1C10-48A0-B4D5-035CB5EEFE62,15327.0,2019-01-24 17:49:12+00:00,2019-01-24 21:58:59+00:00,Groupe PEL,CLOSED,1,NaN,tiller-order,3,60.0,60.0,0,249.783333
4,55558817,8052,NaN,NaN,NaN,17F0533C-2FF1-4FC5-A50D-12704C7B7A4B,15327.0,2019-01-12 15:25:06+00:00,2019-01-12 19:21:03+00:00,remi et date,CLOSED,1,NaN,Tiller iPAD,2,39.9,39.9,0,235.950000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117299,61630471,4542,NaN,NaN,NaN,C4A0AFD8-FBD7-4740-A48B-4890F46E43E2,7411.0,2019-02-28 13:13:21+00:00,2019-02-28 13:38:45+00:00,NaN,CLOSED,1,NaN,Tiller iPAD,1,23.0,23.0,0,25.400000
117300,76772730,4542,NaN,NaN,NaN,95A17B0B-22AE-43A1-8BEB-B105BF337655,7411.0,2019-06-11 11:08:01+00:00,2019-06-11 11:10:26+00:00,NaN,CLOSED,1,NaN,Tiller iPAD,1,26.0,26.0,0,2.416667
117301,77799227,4542,NaN,NaN,NaN,0E5D4843-7EA3-4D9E-9490-EB9717A0220F,7411.0,2019-06-17 10:30:50+00:00,2019-06-17 10:32:45+00:00,NaN,CLOSED,1,NaN,Tiller iPAD,1,29.0,29.0,0,1.916667
117302,60627160,4542,NaN,NaN,NaN,CE760A3B-4464-462A-AA2C-CCFEB88EEC39,7411.0,2019-02-21 11:50:58+00:00,2019-02-21 11:51:56+00:00,NaN,CLOSED,1,NaN,Tiller iPAD,1,32.0,32.0,0,0.966667
117303,93223821,4542,NaN,NaN,NaN,F004A307-C7C9-4508-A587-49ED5CF8F156,7411.0,2019-09-18 11:32:35+00:00,2019-09-18 11:39:38+00:00,NaN,CLOSED,1,NaN,Tiller iPAD,1,17.0,17.0,0,7.050000

r) Run the code below to calculate the time spent between the open and close date of an order in minutes.

In [185]:
df["order_duration"] = (df.date_closed - df.date_opened).dt.total_seconds() / 60
df.head(3)

C:\Users\p.nguyen\AppData\Local\Temp\ipykernel_26860\2932671850.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["order_duration"] = (df.date_closed - df.date_opened).dt.total_seconds() / 60

,id_order,id_store,id_table,id_waiter,id_customer,id_external,id_device,date_opened,date_closed,dim_name,dim_status,dim_type,dim_comment,dim_source,m_nb_customer,m_cached_payed,m_cached_price,order_per_customer,order_duration
0,55538867,8052,NaN,NaN,NaN,0425716B-EFF4-41CA-AEA1-839104F36833,15327.0,2019-01-12 13:02:17+00:00,2019-01-12 19:58:38+00:00,vincent,CLOSED,1,NaN,Tiller iPAD,1,45.5,45.5,0,416.350000
1,56035309,8052,NaN,NaN,NaN,75E41FE2-64FF-41D3-954C-A7DE4AA887EF,15327.0,2019-01-16 19:39:09+00:00,2019-01-16 22:10:50+00:00,frere et soeur avec pierre,CLOSED,1,NaN,Tiller iPAD,2,49.8,49.8,0,151.683333
2,55550051,8052,NaN,NaN,NaN,F6051A05-C9AC-4033-BF72-BB5149B8F439,15327.0,2019-01-12 14:18:46+00:00,2019-01-12 19:50:32+00:00,rachel,CLOSED,1,NaN,Tiller iPAD,1,27.4,27.4,0,331.766667

In [183]:
#Let's try it
df["order_duration"] = (df.date_closed - df.date_opened).dt.total_seconds() / 60

C:\Users\p.nguyen\AppData\Local\Temp\ipykernel_26860\4293396501.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["order_duration"] = (df.date_closed - df.date_opened).dt.total_seconds() / 60

s) Calculate the average time at the table for each of the restaurants.

In [190]:
#Let's try it :-)
# dont forget []
avg_time = df.groupby(['id_store', 'id_table'])['order_duration'].mean().reset_index()
avg_time

    id_store  id_table  order_duration
0        360    3199.0       89.644592
1        360    3200.0      100.335584
2        360    3201.0       99.484146
3        360    3202.0       90.954392
4        360    3203.0       83.507494
..       ...       ...             ...
92      9084  288078.0      143.523783
93      9084  288080.0      130.499383
94      9084  288081.0      121.558796
95      9084  288082.0      128.523718
96      9084  288083.0      149.903333

[97 rows x 3 columns]

It seems that there are no fast food type restaurants! Open order durations are relatively short.

### Join operations

t) Download data from [order_line](https://drive.google.com/file/d/1G7Jbq_m-tJrHRhL-44j8XFOVs_zPil_9/view?usp=sharing) and [store_data](https://drive.google.com/file/d/1W032PaySL7gouyX3bEKgndtm6qVta7Qp/view?usp=sharing). Load them in Python.

In [203]:
#Let's try it :-)
df_store_data = pd.read_csv('./Tiller_store_data.csv')
df_store_data

     id_store               date_created dim_zipcode dim_country dim_currency
0        2576  2016-07-12 16:15:31+00:00       34120          FR          EUR
1        2538  2016-07-07 16:35:44+00:00       47800          FR          EUR
2        2468  2016-06-30 12:44:25+00:00       06470          FR          EUR
3        2375  2016-06-21 12:52:36+00:00       76000          FR          EUR
4        2328  2016-06-16 13:59:52+00:00       75018          FR          EUR
..        ...                        ...         ...         ...          ...
495     11412  2019-11-11 17:38:57+00:00        7500          CH          CHF
496      3453  2016-12-05 17:40:56+00:00     Abidjan          CI          XOF
497      1070  2016-01-15 08:44:03+00:00       01 BP          CI          XOF
498       425  2015-08-28 18:58:25+00:00        2687          GN          GNF
499     10009  2019-06-06 14:35:42+00:00        4059          CH          CHF

[500 rows x 5 columns]

In [195]:
#Let's try it :-)
df_order_line = pd.read_csv('./Tiller_order_line.csv')

df_order_line.head(2)

,id_order_line,id_order,date_opended,date_created,m_quantity,m_unit_price,m_unit_price_exc_vat,m_total_price_inc_vat,m_total_price_exc_vat,m_tax_percent,m_discount_amount,dim_type,dim_category,dim_name,dim_status,m_nb_payed,dim_feature_type,dim_unit_measure,dim_unit_measure_display
0,626609716,139058632,2020-08-25 17:27:14 UTC,2020-08-25 17:27:25 UTC,1.0,15.0,12.500000,15.0,12.500000,0.2,0.0,PRODUCT,VINS ROUGES,TWIST AGAIN 2018 VDF - YOANN ROMAGNE,DONE,0,NaN,UNIT,UNIT
1,403167240,94770355,2019-09-27 07:47:14 UTC,2019-09-27 07:47:18 UTC,1.0,25.9,21.583333,25.9,21.583333,0.2,0.0,PRODUCT,LIQUIDES 50ML AUTRES,MOMMY CAKE,DONE,0,NaN,UNIT,UNIT

u) What new information do you have access to thanks to this data?

In [196]:
#Let's try it :-)
df_order_line.keys()

Index(['id_order_line', 'id_order', 'date_opended', 'date_created',
       'm_quantity', 'm_unit_price', 'm_unit_price_exc_vat',
       'm_total_price_inc_vat', 'm_total_price_exc_vat', 'm_tax_percent',
       'm_discount_amount', 'dim_type', 'dim_category', 'dim_name',
       'dim_status', 'm_nb_payed', 'dim_feature_type', 'dim_unit_measure',
       'dim_unit_measure_display'],
      dtype='object')

In [197]:
#Let's try it :-)
df_store_data.keys()

Index(['id_store', 'date_created', 'dim_zipcode', 'dim_country',
       'dim_currency'],
      dtype='object')

v) How many orders were placed in the 2nd arrondissement of Paris? It will take merging store_data with the seed data to answer it.

In [209]:
#Let's try it :-)
#zip code  2nd arrondissement of Paris is 75002.
df_merged = pd.merge(df, df_store_data, on='id_store', how='left')
df_merged.groupby('dim_zipcode').size().reset_index(name='orders')

  dim_zipcode  orders
0       75001   57224
1       75002   59381

w) Take restaurant 1796. Its average order time was very short.

Show the most ordered items in this restaurant. To do this keep only the id_store and id_order columns of order_data and the id_order, id_order_line and dim_name columns of order_line.

Be careful, the dim_name column exists both in order_data and in order_line.

In [227]:
#Let's try it :-)
#keep only the id_store and id_order columns of order_data 
df_order_data_reduced = df[['id_store', 'id_order']]

df_order_data_reduced
#the id_order, id_order_line and dim_name columns of order_line
df_order_line_reduced = df_order_line[['id_order', 'id_order_line', 'dim_name']]
df_order_line_reduced

df_merged = pd.merge(df_order_data_reduced,df_order_line_reduced,on='id_order',how='left')
df_merged= df_merged.groupby('dim_name').size().reset_index(name='orders')

In [232]:
df_merged.sort_values('orders', ascending=False)

                      dim_name  orders
318                        BIG   13263
919                   Cocktail   12877
742                COMPOSITION   10152
3222                TICKET JEU   10091
2481       POKE SUPER PROTEINE    8187
...                        ...     ...
3141   Supplement amande fumée       1
1387               GROCIN 2019       1
1389  GROCIN PRIMEUR 2019, VDF       1
1399             GRORAH 12 cL        1
3992               Œufs mimosa       1

[3993 rows x 2 columns]

Is it a fast lunch restaurant in your opinion?

### Data cleaning

x) [More difficult] The dim_name column of order_data data is unstructured because it is a free field. We want to clean it by creating a new "processed_dim_name" column with:

- Any value composed solely of numbers, whether or not preceded by a capital letter (example: B124, A7, 42) will be categorized as "Code"
- Any value including "TheFork" will be categorized as "TheFork"
- All remaining values ​​will be categorized as "Person"
- Empty values ​​or character strings containing only spaces will be put empty

You can look at the `pd.isna()` function, the regex with the `re` library.

In [244]:
import re

The getCategory function gets its parameter value from the .apply() method when you apply it to a pandas Series or DataFrame column. Here's how it works:

You define the getCategory function with a single parameter, which we commonly name value to represent the current value being processed.

When you use the .apply() method on a Series or DataFrame column, it iterates over each element in that column.

For each element in the column, the .apply() method calls the getCategory function and passes the current element as an argument to the value parameter.

Inside the getCategory function, you can access and process the value passed as the value parameter. You can perform operations, checks, and any logic needed to categorize the value.

In [251]:
#Let's try it :-)

def getCategory(value):
    #value = value.strip() #remove spaces
    value = str(value)
    code_pattern = r'^[A-Z]?\d+$'
    
    #check if value is 'Code'
    if re.match(code_pattern, value):
        return 'Code'
    #check if value is 'TheFork'
    elif 'TheFork' in value:
        return 'TheFork'
    #check if value is 'no Value' => ''
    elif not value:
        return ''
    #check if value is 'Person'
    else:
        return 'Person'
df.head(5)
df['processed_dim_name'] = df['dim_name'].apply(getCategory)

df['processed_dim_name'].unique()

C:\Users\p.nguyen\AppData\Local\Temp\ipykernel_26860\1233077845.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['processed_dim_name'] = df['dim_name'].apply(getCategory)

array(['Person', 'Code'], dtype=object)

y) To meet the needs of a team, we want to calculate the number of orders per restaurant and processed_dim_name. Create this dataframe.

In [252]:
#Let's try it :-)
df_new = df.groupby(['id_store', 'processed_dim_name']).size().reset_index(name='orders')
df_new

    id_store processed_dim_name  orders
0        360               Code     528
1        360             Person    3438
2       1796               Code   24518
3       1796             Person    2619
4       4337             Person   19979
5       4542               Code    9148
6       4542             Person    8491
7       6293               Code     233
8       6293             Person   15866
9       7965               Code     720
10      7965             Person    8369
11      8052               Code     493
12      8052             Person    4406
13      8283               Code   10022
14      8347             Person       1
15      9084               Code    7742
16      9084             Person      32

z) Save the new dataframe in csv. Don't back up your dataframe's index.

In [240]:
#Let's try it :-)
df.to_csv('./export.csv', index=False)